#include "CountryList/CountryList.h"
#include "handlers/handlers.h"

/*
*Олімпіада з програмування. Є два текстові файли. У першому
міститься інформація про країни-учасниці та подані ними командами у
вигляді набору рядків, у кожному з яких назва країни та перелік назв
команд цієї країни. У другому – перелік назв команд у порядку зайнятих
ними місць (передбачається, що немає команд із однаковими назвами).
Потрібно створити список списків: список назв країн, упорядкований за
абеткою, і для кожної країни – список команд із зазначенням зайнятого
ними місця у порядку зростання. Забезпечити операції додавання,
видалення, редагування та розумного пошуку інформації, виведення
інформації в розумному вигляді…
*/

int main() {
    CountryList countryList;
    return mainMenu(&countryList);
}
